Ran Plan for project: `terraform-github` dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
/home/atlantis/.config/sops/age/terraform-github.txt


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.repositories.module.test1.github_branch_default.repo will be created
+ resource "github_branch_default" "repo" {
+       branch     = "main"
+       etag       = (known after apply)
+       id         = (known after apply)
+       rename     = false
+       repository = "test1"
    }

  # module.repositories.module.test1.github_repository.repo will be created
+ resource "github_repository" "repo" {
+       allow_auto_merge            = false
+       allow_merge_commit          = true
+       allow_rebase_merge          = true
+       allow_squash_merge          = true
+       archive_on_destroy          = false
+       archived                    = false
+       auto_init                   = true
+       default_branch              = (known after apply)
+       delete_branch_on_merge      = true
+       description                 = "test1"
+       etag                        = (known after apply)
+       full_name                   = (known after apply)
+       git_clone_url               = (known after apply)
+       has_discussions             = false
+       has_downloads               = false
+       has_issues                  = true
+       has_projects                = false
+       has_wiki                    = false
+       html_url                    = (known after apply)
+       http_clone_url              = (known after apply)
+       id                          = (known after apply)
+       is_template                 = false
+       merge_commit_message        = "PR_TITLE"
+       merge_commit_title          = "MERGE_MESSAGE"
+       name                        = "test1"
+       node_id                     = (known after apply)
+       primary_language            = (known after apply)
+       private                     = (known after apply)
+       repo_id                     = (known after apply)
+       squash_merge_commit_message = "COMMIT_MESSAGES"
+       squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
+       ssh_clone_url               = (known after apply)
+       svn_url                     = (known after apply)
+       topics                      = [
+           "test1",
        ]
+       visibility                  = "private"
+       vulnerability_alerts        = true
+       web_commit_signoff_required = false
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p terraform-github`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.techtales.io/lock?id=techtales-io%252Fterraform-github%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p terraform-github`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`